#include <iostream>

int main() {
	int a, n;
	std::cin >> a >> n;
	// Булевите стойности true и false се изкарват на екрана като 1 и 0 съответно
	// Има и по-кратък вариант на този израз, който е !(a % n), понеже ! e булев оператор, неговата
	// стойност трябва да бъде булева, a % n се конвертира в булева стойност, като ако е 0 става false, иначе е true
	// Така дефакто имаме, че ако а се дели на n имаме false, иначе имаме true, с една негация обръщаме това
	std::cout << (a % n == 0) << std::endl;
}
